'''Определить, является введенное с клавиатуры число положительным или отрицательным?'''
num=int(input())
if num>0:
    print('+')
else:
    print('-')